# Pandas Demos

Because I am constantly forgetting and having to google pandas basics, such as
- File I/O
    - With csv
    - With Excel
- Max columns to display - display all of them always
- Basic statistics
- Dropping and filling nulls
    - In & out of place
- loc and iloc
- filter and query
- Reverse a dataframe top to bottom, left to right
- Plotting using pandas built-ins
- Converting a dictionary to a series
- Promoting a series to a frame
- Adding a series to a frame
- Drop a row (or rows), or column (or columns)
- Scramble or sample a dataframe
- Rename a column or columns
- Using apply on
    - A single column
    - A single row
    - All elements
- string operations
- melting
- masking & logical operators
- grouping (groupby)
- Time operations e.g. dates to pandas way of holding dates

## Imports

In [71]:
import pandas as pd

## File I/O

### Read from csv

In [72]:
df = pd.read_csv("./data/auto.csv")
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
387,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
388,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
389,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
390,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
391,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

### Write to csv

Make sure to include `index=False` to suppress the index from the file, or you will have inadvertently added a column to the output

In [73]:
df.to_csv("./data/auto-ignore.csv", index=False)

Then read it back and verify equality

In [74]:
df2 = pd.read_csv("./data/auto-ignore.csv")
df.equals(df2)

True

### Read from Excel

Not as frequent, but worth it to show that you need a separate install

```console
!pip install openpyxl
```

In [75]:
#!pip install openpyxl

In [76]:
df_from_excel = pd.read_excel("./data/SampleFile.xlsx")
df_from_excel.head(10)

   Widget A  Widget B
0         2         3
1        36        48
2        16        40
3         5         2
4        31        16
5        34        11
6        19        12
7         4         7
8         4        43
9        36        18

## Max Columns to Display

I usually want to have all the columns displayed
- But the default will show up to 20, after which point interior columns are replaced with a "..."
- Instead, set the option to specify the max is none, i.e. never replace with ...

Read & display a dataset with tons of columns

In [77]:
df = pd.read_csv("./data/coupons.csv")

Look at that ugly ellipsis between maritalStatus and CoffeeHouse
- What's odd is that there is still a horizontal slider bar
- What is the utility of both cropping and having a slider - perhaps this is a holdover from older python?

In [78]:
pd.set_option("display.max_columns", 20)
df.head(5)

,destination,passanger,weather,temperature,time,coupon,expiration,gender,age,maritalStatus,...,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50,toCoupon_GEQ5min,toCoupon_GEQ15min,toCoupon_GEQ25min,direction_same,direction_opp,Y
0,No Urgent Place,Alone,Sunny,55,2PM,Restaurant(<20),1d,Female,21,Unmarried partner,...,never,NaN,4~8,1~3,1,0,0,0,1,1
1,No Urgent Place,Friend(s),Sunny,80,10AM,Coffee House,2h,Female,21,Unmarried partner,...,never,NaN,4~8,1~3,1,0,0,0,1,0
2,No Urgent Place,Friend(s),Sunny,80,10AM,Carry out & Take away,2h,Female,21,Unmarried partner,...,never,NaN,4~8,1~3,1,1,0,0,1,1
3,No Urgent Place,Friend(s),Sunny,80,2PM,Coffee House,2h,Female,21,Unmarried partner,...,never,NaN,4~8,1~3,1,1,0,0,1,0
4,No Urgent Place,Friend(s),Sunny,80,2PM,Coffee House,1d,Female,21,Unmarried partner,...,never,NaN,4~8,1~3,1,1,0,0,1,0

Now update the max columns - no ellipsis

In [79]:
pd.set_option("display.max_columns", None)
df.head(5)

,destination,passanger,weather,temperature,time,coupon,expiration,gender,age,maritalStatus,has_children,education,occupation,income,car,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50,toCoupon_GEQ5min,toCoupon_GEQ15min,toCoupon_GEQ25min,direction_same,direction_opp,Y
0,No Urgent Place,Alone,Sunny,55,2PM,Restaurant(<20),1d,Female,21,Unmarried partner,1,Some college - no degree,Unemployed,$37500 - $49999,NaN,never,never,NaN,4~8,1~3,1,0,0,0,1,1
1,No Urgent Place,Friend(s),Sunny,80,10AM,Coffee House,2h,Female,21,Unmarried partner,1,Some college - no degree,Unemployed,$37500 - $49999,NaN,never,never,NaN,4~8,1~3,1,0,0,0,1,0
2,No Urgent Place,Friend(s),Sunny,80,10AM,Carry out & Take away,2h,Female,21,Unmarried partner,1,Some college - no degree,Unemployed,$37500 - $49999,NaN,never,never,NaN,4~8,1~3,1,1,0,0,1,1
3,No Urgent Place,Friend(s),Sunny,80,2PM,Coffee House,2h,Female,21,Unmarried partner,1,Some college - no degree,Unemployed,$37500 - $49999,NaN,never,never,NaN,4~8,1~3,1,1,0,0,1,0
4,No Urgent Place,Friend(s),Sunny,80,2PM,Coffee House,1d,Female,21,Unmarried partner,1,Some college - no degree,Unemployed,$37500 - $49999,NaN,never,never,NaN,4~8,1~3,1,1,0,0,1,0

## Basic Statistics

Read a dataset and display summary stats per column

In [80]:
df = pd.read_csv("./data/auto.csv")
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino

### Summarize the Entire Frame

Non-numeric types are automatically excluded

In [81]:
df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin
count,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000
mean,23.445918,5.471939,194.411990,104.469388,2977.584184,15.541327,75.979592,1.576531
std,7.805007,1.705783,104.644004,38.491160,849.402560,2.758864,3.683737,0.805518
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.000000,4.000000,105.000000,75.000000,2225.250000,13.775000,73.000000,1.000000
50%,22.750000,4.000000,151.000000,93.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,275.750000,126.000000,3614.750000,17.025000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

### Sample Single Operation

Perform an example operation (summation) per column
- This sums all rows, for each column
- Notice the unexpected `name` result - it summed the strings (in python, string summing means concatenating)

In [82]:
df.sum()

mpg                                                        9190.8
cylinders                                                    2145
displacement                                              76209.5
horsepower                                                40952.0
weight                                                    1167213
acceleration                                               6092.2
year                                                        29784
origin                                                        618
name            chevrolet chevelle malibubuick skylark 320plym...
dtype: object

Flip it around, and sum all columns, for each row
- Exclude the `name` column (which has type `object`) because it can't sum with the numeric columns

In [83]:
df.select_dtypes(exclude=object).sum(axis=1)

0      4050.0
1      4313.5
2      4012.0
3      3994.0
4      3997.5
        ...
387    3145.6
388    2435.6
389    2644.6
390    2957.6
391    3058.4
Length: 392, dtype: float64

Redisplay the first row of the dataframe to verify the summation above

In [84]:
df.head(1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu

In [85]:
18 + 8 + 307 + 130 + 3504 + 12 + 70 + 1

4050

## Dropping and Filling Nulls

Empty cells in a table are rendered as NaN in pandas - what to do with them?

### Make a Toy Dataset with a Few Nulls

Also save it to csv

In [99]:
df = pd.DataFrame(
    [
        {
            "name": "Alice",
            "age": 25,
            "ice cream": "chocolate",
            "height": 60.0,
        },
        {
            "name": "Bob",
            "age": 30,
            "height": 66,
        },
        {
            "name": "Charlie",
            "age": 35,
            "ice cream": "vanilla",
        },
        {
            "name": "Sarah",
            "age": 24,
            "ice cream": "rocky road",
            "height": 63.2,
        },
        {
            "name": "Vera",
            "age": 82,
            "ice cream": "black cherry",
        },
    ]
)

df

      name  age     ice cream  height
0    Alice   25     chocolate    60.0
1      Bob   30           NaN    66.0
2  Charlie   35       vanilla     NaN
3    Sarah   24    rocky road    63.2
4     Vera   82  black cherry     NaN

In [100]:
df.to_csv("./data/toy-dataset-with-nan.csv", index=False)

Sidebar: `isna` or `isnull`?

They are the same!

In [101]:
df.isna().equals(df.isnull())

True

How many columns have nulls?

In [102]:
(df.isna().sum(axis=0) > 0).sum()

np.int64(2)

Do all columns have nulls?

In [103]:
(df.isna().sum(axis=0) > 0).sum() == df.shape[1]

np.False_

Which columns have nulls?

In [104]:
df.columns[df.isna().sum(axis="rows") > 0].to_list()

['ice cream', 'height']

How many rows have nulls?

In [105]:
(df.isna().sum(axis="columns") > 0).sum()

np.int64(3)

Do all rows have nulls?

In [106]:
(df.isna().sum(axis=1) > 0).sum() == df.shape[0]

np.False_

Drop any rows that contain nulls, assigning to a new dataframe

In [107]:
df_no_nulls_in_rows = df.dropna()
df_no_nulls_in_rows

    name  age   ice cream  height
0  Alice   25   chocolate    60.0
3  Sarah   24  rocky road    63.2

As above, but do it in place

In [108]:
df.dropna(inplace=True)
df.equals(df_no_nulls_in_rows)

True

Rather than dropping rows containing nulls, replace the nulls with zeros

In [109]:
df = pd.read_csv("./data/toy-dataset-with-nan.csv").fillna(value=0.0)
df

      name  age     ice cream  height
0    Alice   25     chocolate    60.0
1      Bob   30           0.0    66.0
2  Charlie   35       vanilla     0.0
3    Sarah   24    rocky road    63.2
4     Vera   82  black cherry     0.0